In [1]:
from base import exports
import logging
from pandasql import sqldf
import pandas as pd

log = logging.getLogger(__name__)
logging.basicConfig(level=logging.INFO)

### Public School Directory

In [2]:
df = exports.get_df_from_csv(file_name='data/escuelas_publicas_2017.csv')

In [3]:
list(df)

['BAJO_NIVEL_POBREZA',
 'CODIGO',
 'DIRECCION_MUNICIPIO',
 'DIRECCION_ZIPCODE',
 'DIRECCIO_ESTADO',
 'DIRECCIO_FISICA',
 'DIRECTOR',
 'DISTRITO',
 'ESCUELA',
 'ESPAÑOL_AVANZADO',
 'ESPAÑOL_BÁSICO',
 'ESPAÑOL_PRE-BÁSICO',
 'ESPAÑOL_PROFICIENTE',
 'ESPAÑOL_[PROFICIENTE+AVANZADO]',
 'ESTATUS_ACTUAL',
 'FAX',
 'GEOLOCALIZACION',
 'GRADOS_ORIGINAL',
 'GRADOS_POSTERIOR',
 'GRADO_1',
 'GRADO_10',
 'GRADO_11',
 'GRADO_12',
 'GRADO_2',
 'GRADO_3',
 'GRADO_4',
 'GRADO_5',
 'GRADO_6',
 'GRADO_7',
 'GRADO_8',
 'GRADO_9',
 'GRADO_INFANT',
 'GRADO_K',
 'GRADO_PK',
 'GRADO_PKE',
 'GRADO_PKM',
 'GRADO_SGE',
 'GRADO_SGI',
 'GRADO_SGS',
 'GRADO_TODDLER',
 'INGLÉS_AVANZADO',
 'INGLÉS_BÁSICO',
 'INGLÉS_PRE-BÁSICO',
 'INGLÉS_PROFICIENTE',
 'INGLÉS_[PROFICIENTE+AVANZADO]',
 'MATEMÁTICAS_AVANZADO',
 'MATEMÁTICAS_BÁSICO',
 'MATEMÁTICAS_PRE-BÁSICO',
 'MATEMÁTICAS_PROFICIENTE',
 'MATEMÁTICAS_[PROFICIENTE+AVANZADO]',
 'MATRICULA_TOTAL',
 'MUNICIPIO_ESCOLAR',
 'NIVEL_ORIGINAL',
 'REGION',
 'TABLE_ID',
 'TELEFONO',
 'ZONA']

In [4]:
query = 'SELECT count(*), REGION from df group by 2 order by 1 desc'
schools_per_region = sqldf(query)

In [5]:
schools_per_region

   count(*)    REGION
0       181     PONCE
1       174  MAYAGUEZ
2       170  SAN JUAN
3       164    CAGUAS
4       160   HUMACAO
5       145   BAYAMON
6       138   ARECIBO